In [1]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\User\Downloads\Flavors.csv")
df

,Flavor,Base Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
0,Mint Chocolate Chip,Vanilla,Yes,10.0,8.0,18.0
1,Chocolate,Chocolate,Yes,8.8,7.6,16.6
2,Vanilla,Vanilla,No,4.7,5.0,9.7
3,Cookie Dough,Vanilla,Yes,6.9,6.5,13.4
4,Rocky Road,Chocolate,Yes,8.2,7.0,15.2
5,Pistachio,Vanilla,No,2.3,3.4,5.7
6,Cake Batter,Vanilla,Yes,6.5,6.0,12.5
7,Neapolitan,Vanilla,No,3.8,5.0,8.8
8,Chocolte Fudge Brownie,Chocolate,Yes,8.2,7.1,15.3

In [5]:
gr_df=df.groupby('Base Flavor')

In [7]:
gr_df.mean(numeric_only=True)

             Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate              8.4        7.233333         15.70
Vanilla                5.7        5.650000         11.35

In [9]:
gr_df.median(numeric_only=True)

             Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate              8.2             7.1          15.3
Vanilla                5.6             5.5          11.1

In [10]:
df.describe()

       Flavor Rating  Texture Rating  Total Rating
count         9.0000        9.000000      9.000000
mean          6.6000        6.177778     12.800000
std           2.5387        1.478832      4.030509
min           2.3000        3.400000      5.700000
25%           4.7000        5.000000      9.700000
50%           6.9000        6.500000     13.400000
75%           8.2000        7.100000     15.300000
max          10.0000        8.000000     18.000000

In [16]:
gr_df.agg({'Flavor Rating': ['min','max','std','mean']})

            Flavor Rating
                      min   max       std mean
Base Flavor
Chocolate             8.2   8.8  0.346410  8.4
Vanilla               2.3  10.0  2.710719  5.7

In [17]:
df.groupby(['Base Flavor','Liked']).mean(numeric_only=True)

                   Flavor Rating  Texture Rating  Total Rating
Base Flavor Liked
Chocolate   Yes              8.4        7.233333     15.700000
Vanilla     No               3.6        4.466667      8.066667
            Yes              7.8        6.833333     14.633333

In [22]:
df.groupby(['Base Flavor','Liked']).agg({'Flavor Rating':['min','max','mean','sum']})

                  Flavor Rating
                            min   max mean   sum
Base Flavor Liked
Chocolate   Yes             8.2   8.8  8.4  25.2
Vanilla     No              2.3   4.7  3.6  10.8
            Yes             6.5  10.0  7.8  23.4

In [24]:
df2=pd.read_csv(r"C:\Users\User\Downloads\LOTR.csv")
df2

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [106]:
df3=pd.read_csv(r"C:\Users\User\Downloads\LOTR 2.csv")
df3

   FellowshipID FirstName   Age
0          1001     Frodo    50
1          1002   Samwise    39
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51

In [28]:
df2.merge(df3)

   FellowshipID FirstName     Skills  Age
0          1001     Frodo     Hiding   50
1          1002   Samwise  Gardening   39

In [29]:
df2.merge(df3,how='inner',on=['FellowshipID','FirstName'])

   FellowshipID FirstName     Skills  Age
0          1001     Frodo     Hiding   50
1          1002   Samwise  Gardening   39

In [30]:
df2.merge(df3,how='outer')

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding    50.0
1          1002   Samwise  Gardening    39.0
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
4          1006   Legolas        NaN  2931.0
5          1007    Elrond        NaN  6520.0
6          1008  Barromir        NaN    51.0

In [31]:
df2.merge(df3,how='left')

   FellowshipID FirstName     Skills   Age
0          1001     Frodo     Hiding  50.0
1          1002   Samwise  Gardening  39.0
2          1003   Gandalf     Spells   NaN
3          1004    Pippin  Fireworks   NaN

In [54]:
df2.merge(df3,how='right')

   FellowshipID FirstName     Skills   Age
0          1001     Frodo     Hiding    50
1          1002   Samwise  Gardening    39
2          1006   Legolas        NaN  2931
3          1007    Elrond        NaN  6520
4          1008  Barromir        NaN    51

In [33]:
df2.merge(df3,how='cross')

    FellowshipID_x FirstName_x     Skills  FellowshipID_y FirstName_y   Age
0             1001       Frodo     Hiding            1001       Frodo    50
1             1001       Frodo     Hiding            1002     Samwise    39
2             1001       Frodo     Hiding            1006     Legolas  2931
3             1001       Frodo     Hiding            1007      Elrond  6520
4             1001       Frodo     Hiding            1008    Barromir    51
5             1002     Samwise  Gardening            1001       Frodo    50
6             1002     Samwise  Gardening            1002     Samwise    39
7             1002     Samwise  Gardening            1006     Legolas  2931
8             1002     Samwise  Gardening            1007      Elrond  6520
9             1002     Samwise  Gardening            1008    Barromir    51
10            1003     Gandalf     Spells            1001       Frodo    50
11            1003     Gandalf     Spells            1002     Samwise    39
12            1003     Gandalf     Spells            1006     Legolas  2931
13            1003     Gandalf     Spells            1007      Elrond  6520
14            1003     Gandalf     Spells            1008    Barromir    51
15            1004      Pippin  Fireworks            1001       Frodo    50
16            1004      Pippin  Fireworks            1002     Samwise    39
17            1004      Pippin  Fireworks            1006     Legolas  2931
18            1004      Pippin  Fireworks            1007      Elrond  6520
19            1004      Pippin  Fireworks            1008    Barromir    51

In [40]:
df2.join(df3,how='left',on='FellowshipID',lsuffix='_left',rsuffix='_right') #it is so complicated

,FellowshipID,FellowshipID_left,FirstName_left,Skills,FellowshipID_right,FirstName_right,Age
0,1001,1001,Frodo,Hiding,NaN,NaN,NaN
1,1002,1002,Samwise,Gardening,NaN,NaN,NaN
2,1003,1003,Gandalf,Spells,NaN,NaN,NaN
3,1004,1004,Pippin,Fireworks,NaN,NaN,NaN

In [46]:
df4=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right')
df4

             FirstName_left     Skills FirstName_right   Age
FellowshipID
1001                  Frodo     Hiding           Frodo  50.0
1002                Samwise  Gardening         Samwise  39.0
1003                Gandalf     Spells             NaN   NaN
1004                 Pippin  Fireworks             NaN   NaN

In [48]:
df4=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='inner')
df4

             FirstName_left     Skills FirstName_right  Age
FellowshipID
1001                  Frodo     Hiding           Frodo   50
1002                Samwise  Gardening         Samwise   39

In [53]:
df4=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='right')
df4

             FirstName_left     Skills FirstName_right   Age
FellowshipID
1001                  Frodo     Hiding           Frodo    50
1002                Samwise  Gardening         Samwise    39
1006                    NaN        NaN         Legolas  2931
1007                    NaN        NaN          Elrond  6520
1008                    NaN        NaN        Barromir    51

In [50]:
df4=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer')
df4

             FirstName_left     Skills FirstName_right     Age
FellowshipID
1001                  Frodo     Hiding           Frodo    50.0
1002                Samwise  Gardening         Samwise    39.0
1003                Gandalf     Spells             NaN     NaN
1004                 Pippin  Fireworks             NaN     NaN
1006                    NaN        NaN         Legolas  2931.0
1007                    NaN        NaN          Elrond  6520.0
1008                    NaN        NaN        Barromir    51.0

In [56]:
df5=pd.concat([df2,df3])
df5

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding     NaN
1          1002   Samwise  Gardening     NaN
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
0          1001     Frodo        NaN    50.0
1          1002   Samwise        NaN    39.0
2          1006   Legolas        NaN  2931.0
3          1007    Elrond        NaN  6520.0
4          1008  Barromir        NaN    51.0

In [57]:
df5=pd.concat([df2,df3],join='inner')
df5

   FellowshipID FirstName
0          1001     Frodo
1          1002   Samwise
2          1003   Gandalf
3          1004    Pippin
0          1001     Frodo
1          1002   Samwise
2          1006   Legolas
3          1007    Elrond
4          1008  Barromir

In [62]:
df5=pd.concat([df2,df3],axis=1)
df5

   FellowshipID FirstName     Skills  FellowshipID FirstName   Age
0        1001.0     Frodo     Hiding          1001     Frodo    50
1        1002.0   Samwise  Gardening          1002   Samwise    39
2        1003.0   Gandalf     Spells          1006   Legolas  2931
3        1004.0    Pippin  Fireworks          1007    Elrond  6520
4           NaN       NaN        NaN          1008  Barromir    51

#Tasks

In [108]:
# 1. **`merge()`** istifad edrk, **FellowshipID** zr iki dataset-i birldirin.
df=df2.merge(df3,on='FellowshipID')
df

   FellowshipID FirstName_x     Skills FirstName_y  Age
0          1001       Frodo     Hiding       Frodo   50
1          1002     Samwise  Gardening     Samwise   39

In [ ]:
# 2. **`join()`** il **FellowshipID** zr birldirm edin.

In [114]:
df=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right')
df

             FirstName_left     Skills FirstName_right   Age
FellowshipID
1001                  Frodo     Hiding           Frodo  50.0
1002                Samwise  Gardening         Samwise  39.0
1003                Gandalf     Spells             NaN   NaN
1004                 Pippin  Fireworks             NaN   NaN

In [ ]:
# 3. **`query()`** funksiyas il **Age** 30-dan yuxar olan xslri tapn.

In [118]:
df3.query("Age>30")

   FellowshipID FirstName   Age
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51

In [ ]:
# 4. **`filter()`** funksiyasn istifad edrk, yalnz **FirstName** v **Skills** stunlarn sein.

In [119]:
df2.filter(items=['FirstName','Skills'])

  FirstName     Skills
0     Frodo     Hiding
1   Samwise  Gardening
2   Gandalf     Spells
3    Pippin  Fireworks

In [ ]:
# 5. **`drop_duplicates()`** il tkrarlanan **FirstName** olan xslri silin.

In [122]:
df2.drop_duplicates(subset='FirstName',keep='first')

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [ ]:
# 6. **`sort_values()`** il **Age** stunu zr **ascending** (artan) qaydada sralayn.

In [125]:
df3.sort_values(by='Age')

   FellowshipID FirstName   Age
1          1002   Samwise    39
0          1001     Frodo    50
4          1008  Barromir    51
2          1006   Legolas  2931
3          1007    Elrond  6520

In [ ]:
# 7. **`set_index()`** il **FellowshipID** stununu index olaraq tyin edin.

In [126]:
df2.set_index('FellowshipID')

             FirstName     Skills
FellowshipID
1001             Frodo     Hiding
1002           Samwise  Gardening
1003           Gandalf     Spells
1004            Pippin  Fireworks

In [ ]:
# 8. **`sort_values()`** il **FirstName** zr azalan qaydada sralama edin.

In [127]:
df2.sort_values(by='FirstName',ascending=False)

   FellowshipID FirstName     Skills
1          1002   Samwise  Gardening
3          1004    Pippin  Fireworks
2          1003   Gandalf     Spells
0          1001     Frodo     Hiding

In [ ]:
# 9. **`sort_values()`** il hm **Age**, hm d **FirstName** stunlarna gr sralayn.

In [128]:
df3.sort_values(by=['Age','FirstName'])

   FellowshipID FirstName   Age
1          1002   Samwise    39
0          1001     Frodo    50
4          1008  Barromir    51
2          1006   Legolas  2931
3          1007    Elrond  6520

In [145]:
# 10. **`query()`** funksiyasn istifad edrk, **Skills** "Hiding" olanlar v **Age** 30-dan yuxar olanlar tapn.

In [148]:
joins=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),on='FellowshipID',lsuffix='_left',rsuffix='_right',how='inner')
df=joins.query("Skills=='Hiding' and Age>30")
df

             FirstName_left  Skills FirstName_right  Age
FellowshipID
1001                  Frodo  Hiding           Frodo   50

In [151]:
df=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='inner').query("Skills=='Hiding' and Age>30")
df

             FirstName_left  Skills FirstName_right  Age
FellowshipID
1001                  Frodo  Hiding           Frodo   50

In [ ]:
# 11. **`groupby()`** il **Skills**- gr qrupladrn v hr bir qrupun ortalama yan tapn.

In [158]:
merged=df2.merge(df3,on=['FellowshipID','FirstName'],how='outer')
merged.groupby('Skills').mean(numeric_only=True)

           FellowshipID   Age
Skills
Fireworks        1004.0   NaN
Gardening        1002.0  39.0
Hiding           1001.0  50.0
Spells           1003.0   NaN

In [ ]:
# 12. **`groupby()`** il **Skills**- gr qrupladrn v hr qrupun n kiik yan tapn.

In [161]:
merged=df2.merge(df3,on=['FellowshipID','FirstName'],how='outer')
merged.groupby('Skills').min('Age')

           FellowshipID   Age
Skills
Fireworks          1004   NaN
Gardening          1002  39.0
Hiding             1001  50.0
Spells             1003   NaN

In [ ]:
# 13. **`groupby()`** il **Skills**- gr qrupladrn v n byk **Age** olanlar tapn.

In [163]:
merged=df2.merge(df3,on=['FellowshipID','FirstName'],how='outer')
merged.groupby('Skills').max('Age')

           FellowshipID   Age
Skills
Fireworks          1004   NaN
Gardening          1002  39.0
Hiding             1001  50.0
Spells             1003   NaN

In [ ]:
# 14. **`groupby()`** il **Skills**- gr qrupladrn v hr bir qrupun sayn tapn.

In [170]:
df2.groupby('Skills').size()

Skills
Fireworks    1
Gardening    1
Hiding       1
Spells       1
dtype: int64

In [ ]:
# 15. **`groupby()`** il **FellowshipID** v **Skills**- gr qrupladrn v n kiik yalar tapn.

In [171]:
merged=df2.merge(df3,on=['FellowshipID','FirstName'],how='outer')
merged.groupby(['FellowshipID','Skills']).min('Age')

                         Age
FellowshipID Skills
1001         Hiding     50.0
1002         Gardening  39.0
1003         Spells      NaN
1004         Fireworks   NaN

In [ ]:

# 16. **`merge()`** funksiyasn istifad edrk, **FellowshipID** v **FirstName** stunlarna saslanaraq iki dataset-i birldirin.

In [173]:
df2.merge(df3,on=['FellowshipID','FirstName'],how='outer')

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding    50.0
1          1002   Samwise  Gardening    39.0
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
4          1006   Legolas        NaN  2931.0
5          1007    Elrond        NaN  6520.0
6          1008  Barromir        NaN    51.0

In [ ]:
# 17. **`merge()`** funksiyasn istifad edrk 'FirstName' stununa gr birldirm edin.

In [175]:
df2.merge(df3,on=['FirstName'])

   FellowshipID_x FirstName     Skills  FellowshipID_y  Age
0            1001     Frodo     Hiding            1001   50
1            1002   Samwise  Gardening            1002   39

In [ ]:
# 18. **`concat()`** istifad edrk, iki DataFrame-i **vertikal** olaraq birldirin (stir zr birlm).

In [178]:
pd.concat([df2,df3],ignore_index=True)

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding     NaN
1          1002   Samwise  Gardening     NaN
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
0          1001     Frodo        NaN    50.0
1          1002   Samwise        NaN    39.0
2          1006   Legolas        NaN  2931.0
3          1007    Elrond        NaN  6520.0
4          1008  Barromir        NaN    51.0

In [ ]:
# 19. **`concat()`** istifad edrk, iki DataFrame-i **horizontal** olaraq birldirin (stun zr birlm).

In [181]:
pd.concat([df2,df3],axis=1)

   FellowshipID FirstName     Skills  FellowshipID FirstName   Age
0        1001.0     Frodo     Hiding          1001     Frodo    50
1        1002.0   Samwise  Gardening          1002   Samwise    39
2        1003.0   Gandalf     Spells          1006   Legolas  2931
3        1004.0    Pippin  Fireworks          1007    Elrond  6520
4           NaN       NaN        NaN          1008  Barromir    51

In [ ]:
# 20. **`set_index()`** il **FellowshipID** stununu index olaraq tyin edib, **multi-index** yaradn.

In [182]:
df2.set_index('FellowshipID')

             FirstName     Skills
FellowshipID
1001             Frodo     Hiding
1002           Samwise  Gardening
1003           Gandalf     Spells
1004            Pippin  Fireworks

In [ ]:
# 21. **`nlargest()`** funksiyasn istifad edrk, n byk 5 ya olan xslri tapn.

In [184]:
df3.nlargest(5,'Age')

   FellowshipID FirstName   Age
3          1007    Elrond  6520
2          1006   Legolas  2931
4          1008  Barromir    51
0          1001     Frodo    50
1          1002   Samwise    39

In [ ]:
# 22. **`nsmallest()`** funksiyasn istifad edrk, n kiik 3 ya olan xslri tapn.

In [185]:
df3.nsmallest(3,'Age')

   FellowshipID FirstName  Age
1          1002   Samwise   39
0          1001     Frodo   50
4          1008  Barromir   51

In [ ]:
# 23. **`nlargest()`** funksiyasn istifad edrk, **Age** stununda n byk 3 ya olan **Skills** "Hiding" olanlar tapn.

In [186]:
df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer').query("Skills=='Hiding'").nlargest(3,'Age')

             FirstName_left  Skills FirstName_right   Age
FellowshipID
1001                  Frodo  Hiding           Frodo  50.0

In [ ]:
# 24. **`nsmallest()`** funksiyasn istifad edrk, **Age** stununda n kiik 3 ya olan **Skills** "Spells" olanlar tapn.

In [189]:
df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer').query("Skills=='Spells'").nsmallest(3,'Age')

             FirstName_left  Skills FirstName_right  Age
FellowshipID
1003                Gandalf  Spells             NaN  NaN

In [ ]:
# 25. **`nlargest()`** funksiyasn istifad edrk, **Age** stununda n byk 10 ya olan **Skills** "Archer" olanlar tapn.

In [190]:
df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer').query("Skills=='Archer'").nlargest(3,'Age')

Empty DataFrame
Columns: [FirstName_left, Skills, FirstName_right, Age]
Index: []

In [ ]:
#26. df2 v df3 DataFrame-lrini FellowshipID zr outer join edin, sonra yalnz "Skills" v "Age" stunlarn saxlayn.

In [191]:
df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer').filter(items=['Skills','Age'])

                 Skills     Age
FellowshipID
1001             Hiding    50.0
1002          Gardening    39.0
1003             Spells     NaN
1004          Fireworks     NaN
1006                NaN  2931.0
1007                NaN  6520.0
1008                NaN    51.0

In [ ]:
#27. groupby() il, hr bir "Skills" qrupunun yalarnn maksimal v minimal dyrlrini tapn.

In [194]:
joins=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer')
joins.groupby('Skills').agg({'Age':['max','min']})

            Age
            max   min
Skills
Fireworks   NaN   NaN
Gardening  39.0  39.0
Hiding     50.0  50.0
Spells      NaN   NaN

In [ ]:
#28. groupby() funksiyas il, "Skills" zr qrupladraraq hr bir qrupun yalarnn cmini v orta ya qiymtini tapn.

In [195]:
joins=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer')
joins.groupby('Skills').agg({'Age':['sum','mean']})

            Age
            sum  mean
Skills
Fireworks   0.0   NaN
Gardening  39.0  39.0
Hiding     50.0  50.0
Spells      0.0   NaN

In [ ]:
#29. query() funksiyasn istifad edrk, "Skills" stununda "Gardening" olan, ya 30-dan boyuk olan v FirstName "Samwise" olmayanlar tapn.

In [202]:
joins=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer')
joins.query("Skills=='Gardening' and Age>30 and `FirstName_left`=='Samwise'")

             FirstName_left     Skills FirstName_right   Age
FellowshipID
1002                Samwise  Gardening         Samwise  39.0

In [ ]:
#30.  concat() istifad edrk, iki DataFrame-i setirler uzre  birldirin,yalnz unikal FirstName olanlar sein.

In [206]:
pd.concat([df2,df3],axis=0,join='outer').drop_duplicates(subset='FirstName')

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding     NaN
1          1002   Samwise  Gardening     NaN
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
2          1006   Legolas        NaN  2931.0
3          1007    Elrond        NaN  6520.0
4          1008  Barromir        NaN    51.0

In [ ]:
#31.  DataFrame-in FirstName v Skills stunlarna saslanaraq index tyin edin.

In [208]:
df2.set_index(['FirstName','Skills'])

                     FellowshipID
FirstName Skills
Frodo     Hiding             1001
Samwise   Gardening          1002
Gandalf   Spells             1003
Pippin    Fireworks          1004

In [ ]:
# 32. filter() funksiyasn istifad edrk, yalnz "Skills" v "Age" stunlarndan ibart yeni bir DataFrame yaradn v "Skills" stununda
# "Fireworks" olanlar sein.

In [211]:
joins=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer')
joins.filter(items=['Skills','Age']).query("Skills=='Hiding'")

              Skills   Age
FellowshipID
1001          Hiding  50.0

In [ ]:
# 33.query() funksiyas il, ya 30-dan boyuk olan v Skills stununda "Gardening" olanlar tapn, sonra hmin xslri FellowshipID zr sralayn.

In [246]:
joins=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer')
joins.query("Age>30 and Skills=='Gardening'").sort_values('FellowshipID')

             FirstName_left     Skills FirstName_right   Age
FellowshipID
1002                Samwise  Gardening         Samwise  39.0

In [ ]:
#34 groupby() funksiyas il hr bir "Skills" zr qrupladrn v qrup bana aadaklar tapn:

# Yalarn cmi (sum)
# Yalarn ortalamas (mean)
# Yalarn maksimum dyri (max)
# Yalarn standart sapmas (std)

In [ ]:
joins=df2.set_index('FellowshipID').join(df3.set_index('FellowshipID'),lsuffix='_left',rsuffix='_right',how='outer')
joins.groupby('Skills').agg({'Age':['sum','mean']})